## production: cloudwatch_alarms
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`



```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.metrics_api_gateway_traffic_change will be created
  + resource "aws_cloudwatch_metric_alarm" "metrics_api_gateway_traffic_change" {
      + actions_enabled                       = true
      + alarm_description                     = "Maximum traffic percentage change between current and previous day"
      + alarm_name                            = "metrics-api-gateway-traffic-change"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + tags_all                              = (known after apply)
      + threshold                             = 20
      + treat_missing_data                    = "missing"

      + metric_query {
          + id          = "current"
          + label       = "Current count"
          + return_data = false

          + metric {
              + dimensions  = {
                  + "ApiName" = "save-metrics"
                }
              + metric_name = "RequestCount"
              + namespace   = "AWS/ApiGateway"
              + period      = 86400
              + stat        = "Sum"
              + unit        = "Count"
            }
        }
      + metric_query {
          + expression  = "ABS(100 * delta/previous)"
          + id          = "percent_change"
          + label       = "Percent change"
          + return_data = true
        }
      + metric_query {
          + expression  = "RATE(current) * PERIOD(current)"
          + id          = "delta"
          + label       = "Delta"
          + return_data = false
        }
      + metric_query {
          + expression  = "current - delta"
          + id          = "previous"
          + label       = "Previous count"
          + return_data = false
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>